OpenNuvoton/M253BSP/SampleCode/StdDriver/I2C_Loopback/main.c
    if (g_u8Enable10BitMode)
    {
        /* Enable I2C 10-bit address mode */
        I2C1->CTL1 |= I2C_CTL1_ADDR10EN_Msk;
        /* Set I2C1 4 Slave Addresses */
        I2C_SetSlaveAddr(I2C1, 0, 0x116, 0);
        I2C_SetSlaveAddr(I2C1, 1, 0x136, 0);
        I2C_SetSlaveAddr(I2C1, 2, 0x156, 0);
        I2C_SetSlaveAddr(I2C1, 3, 0x176, 0);
        /* Set I2C1 4 Slave Addresses Mask */
        I2C_SetSlaveAddrMask(I2C1, 0, 0x04);
        I2C_SetSlaveAddrMask(I2C1, 1, 0x02);
        I2C_SetSlaveAddrMask(I2C1, 2, 0x04);
        I2C_SetSlaveAddrMask(I2C1, 3, 0x02);
    }
    else
    {
        /* Set I2C1 4 Slave Addresses */
        I2C_SetSlaveAddr(I2C1, 0, 0x16, I2C_GCMODE_DISABLE);   /* Slave Address : 0x16 */
        I2C_SetSlaveAddr(I2C1, 1, 0x36, I2C_GCMODE_DISABLE);   /* Slave Address : 0x36 */
        I2C_SetSlaveAddr(I2C1, 2, 0x56, I2C_GCMODE_DISABLE);   /* Slave Address : 0x56 */
        I2C_SetSlaveAddr(I2C1, 3, 0x76, I2C_GCMODE_DISABLE);   /* Slave Address : 0x76 */
        /* Set I2C1 4 Slave Addresses Mask */
        I2C_SetSlaveAddrMask(I2C1, 0, 0x04);
        I2C_SetSlaveAddrMask(I2C1, 1, 0x02);
        I2C_SetSlaveAddrMask(I2C1, 2, 0x04);
        I2C_SetSlaveAddrMask(I2C1, 3, 0x02);
    }

    /* Enable I2C interrupt */
    I2C_EnableInt(I2C1);
    NVIC_EnableIRQ(I2C1_IRQn);
}

void I2C0_Close(void)
{
    /* Disable I2C0 interrupt and clear corresponding NVIC bit */
    I2C_DisableInt(I2C0);
    NVIC_DisableIRQ(I2C0_IRQn);
    /* Disable I2C0 and close I2C0 clock */
    I2C_Close(I2C0);
    CLK_DisableModuleClock(I2C0_MODULE);
}

void I2C1_Close(void)
{
    /* Disable I2C1 interrupt and clear corresponding NVIC bit */
    I2C_DisableInt(I2C1);
    NVIC_DisableIRQ(I2C1_IRQn);
    /* Disable I2C1 and close I2C1 clock */
    I2C_Close(I2C1);
    CLK_DisableModuleClock(I2C1_MODULE);
}

int32_t Read_Write_SLAVE(uint16_t u16SlvAddr)
{
    uint32_t i;

    if (g_u8Enable10BitMode)
    {
        /* Init Send 10-bit Addr */
        g_u8DeviceHAddr = (u16SlvAddr >> 8) | SLV_10BIT_ADDR;
        g_u8DeviceLAddr = u16SlvAddr & 0xFF;
    }
    else
    {
        g_u8DeviceAddr = (u16SlvAddr & 0x7F);
    }

    do
    {
        /* Enable I2C timeout */
        I2C_EnableTimeout(I2C0, 0);
        g_u8MstReStartFlag = 0;
        g_u8TimeoutFlag = 0;

        for (i = 0; i < 0x100; i++)
        {
            uint8_t u8MstTxData;
            g_au8MstTxData[0] = (uint8_t)((i & 0xFF00) >> 8);
            g_au8MstTxData[1] = (uint8_t)(i & 0x00FF);
            g_au8MstTxData[2] = (uint8_t)(g_au8MstTxData[1] + 3);
            u8MstTxData = g_au8MstTxData[2];
            g_u8MstDataLen = 0;
            g_u8MstEndFlag = 0;
            /* I2C0 function to write data to slave */
            s_pfnI2C0Handler = (I2C_FUNC)I2C_MasterTx;
            /* I2C0 as master sends START signal */
            I2C_SET_CONTROL_REG(I2C0, I2C_CTL_STA);

            /* Wait I2C Tx Finish or Unexpected Abort*/
            do
            {
                if (g_u8TimeoutFlag)
                {
                    printf(" MasterTx time out!! Press any to reset IP\n");
                    getchar();
                    SYS_UnlockReg();
                    SYS_ResetModule(I2C0_RST);
                    SYS_LockReg();
                    I2C0_Init();
                    /* Set MasterTx abort flag*/
                    g_u8MstTxAbortFlag = 1;
                }
            } while (g_u8MstEndFlag == 0 && g_u8MstTxAbortFlag == 0);

            g_u8MstEndFlag = 0;

            if (g_u8MstTxAbortFlag)
            {
                /* Clear MasterTx abort flag*/
                g_u8MstTxAbortFlag = 0;
                /* Set Master re-start flag*/
                g_u8MstReStartFlag = 1;
                break;
            }

            /* I2C0 function to read data from slave */
            s_pfnI2C0Handler = (I2C_FUNC)I2C_MasterRx;
            g_u8MstDataLen = 0;
            I2C_SET_CONTROL_REG(I2C0, I2C_CTL_STA);

            /* Wait I2C Rx Finish or Unexpected Abort*/
            do
            {
                if (g_u8TimeoutFlag)
                {
                    /* When I2C timeout, reset IP*/
                    printf(" MasterRx time out!! Press any to reset IP\n");
                    getchar();
                    SYS_UnlockReg();
                    SYS_ResetModule(I2C0_RST);
                    SYS_LockReg();
                    I2C0_Init();
                    /* Set MasterRx abort flag*/
                    g_u8MstRxAbortFlag = 1;
                }
            } while (g_u8MstEndFlag == 0 && g_u8MstRxAbortFlag == 0);

            g_u8MstEndFlag = 0;

            if (g_u8MstRxAbortFlag)
            {
                /* Clear MasterRx abort flag*/
                g_u8MstRxAbortFlag = 0;
                /* Set Master re-start flag*/
                g_u8MstReStartFlag = 1;
                break;
            }

            /* Compare data */
            if (g_u8MstRxData != u8MstTxData)
            {
                /* Disable I2C timeout */
                I2C_DisableTimeout(I2C0);
                printf("I2C Byte Write/Read Failed, Data 0x%x\n", g_u8MstRxData);
                return -1;
            }
        }
    } while (g_u8MstReStartFlag); /*If unexpected abort happens, re-start the transmition*/

    /* Disable I2C timeout */
    I2C_DisableTimeout(I2C0);
    printf("Master Access Slave (0x%X) Test OK\n", u16SlvAddr);
    return 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Main Function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void)
{
    uint32_t i, ch;
    /* Unlock protected registers */
    SYS_UnlockReg();
    /* Init System, IP clock and multi-function I/O. */
    SYS_Init();
    /* Lock protected registers */
    SYS_LockReg();
    /* Configure UART for message printing */
    UartDebugInit();
    /*
        This sample code sets I2C bus clock to 100kHz. Then, Master accesses Slave with Byte Write
        and Byte Read operations, and check if the read data is equal to the programmed data.
    */
    printf("+-------------------------------------------------------+\n");
    printf("| I2C Driver Sample Code for loopback test              |\n");
    printf("|                                                       |\n");
    printf("| I2C Master (I2C0) <---> I2C Slave(I2C1)               |\n");
    printf("+-------------------------------------------------------+\n");
    printf("\n");
    printf("Configure I2C0 as Master, and I2C1 as a slave.\n");
    printf(" - Mode Select, 0: 7-Bit Mode, 1: 10-Bit Mode\n");
    ch = getchar();

