OpenNuvoton/M253BSP/SampleCode/StdDriver/I2C_Loopback/main.c
    if ('1' == ch)
    {
        g_u8Enable10BitMode = 1;
        printf(" -- 10-Bit Mode is selected. (0x115, 0x135)\n");
    }
    else
    {
        g_u8Enable10BitMode = 0;
        printf(" -- 7-Bit Mode is selected. (0x15, 0x35, 0x55, 0x75)\n");
    }

    /* Init I2C0 */
    I2C0_Init();
    /* Init I2C1 */
    I2C1_Init();
    /* I2C1 enter non address SLV mode */
    I2C_SET_CONTROL_REG(I2C1, I2C_CTL_SI_AA);

    for (i = 0; i < 0x100; i++)
    {
        g_au8SlvData[i] = 0;
    }

    /* I2C1 function to Slave receive/transmit data */
    s_pfnI2C1Handler = I2C_SlaveTRx;
    printf("\n");
    printf("I2C1 Slave Mode is Running.\n");

    if (g_u8Enable10BitMode)
    {
        /* Access Slave with no address */
        printf("\n");
        printf(" == No Mask Address ==\n");
        Read_Write_SLAVE(0x116);
        Read_Write_SLAVE(0x136);
        Read_Write_SLAVE(0x156);
        Read_Write_SLAVE(0x176);
        printf("Slave Address test OK.\n");
        /* Access Slave with address mask */
        printf("\n");
        printf(" == Mask Address ==\n");
        Read_Write_SLAVE(0x116 & ~0x04);
        Read_Write_SLAVE(0x136 & ~0x02);
        Read_Write_SLAVE(0x156 & ~0x04);
        Read_Write_SLAVE(0x176 & ~0x02);
        printf("Slave Address Mask test OK.\n");
    }
    else
    {
        /* Access Slave with no address */
        printf("\n");
        printf(" == No Mask Address ==\n");
        Read_Write_SLAVE(0x16);
        Read_Write_SLAVE(0x36);
        Read_Write_SLAVE(0x56);
        Read_Write_SLAVE(0x76);
        printf("Slave Address test OK.\n");
        /* Access Slave with address mask */
        printf("\n");
        printf(" == Mask Address ==\n");
        Read_Write_SLAVE(0x16 & ~0x04);
        Read_Write_SLAVE(0x36 & ~0x02);
        Read_Write_SLAVE(0x56 & ~0x04);
        Read_Write_SLAVE(0x76 & ~0x02);
        printf("Slave Address Mask test OK.\n");
    }

    s_pfnI2C0Handler = NULL;
    s_pfnI2C1Handler = NULL;
    /* Close I2C0,1 */
    I2C0_Close();
    I2C1_Close();

    while (1);
}
